zavd_1 = """
Завдання 1

Створіть програму, яка зчитує рядок, в якому знаходиться ПІБ користувача і перевіряє, чи складається рядок з літер, 
при чому кожне слово має бути записане з великої літери. Вивести результат на екран."""
print(zavd_1)
print()
dani = input("Введіть ПІБ через пробіл з великих літер: ")
while len(dani.split()) != 3:
    dani = input("Введіть ПІБ через пробіл з великої літери: ")
if dani.isalpha() or dani.istitle():
    print(dani)
else:
    print("Не коректно ввели ПІБ")
# ----------------------------------------------------
zavd_2 = """
Завдання 2
Напишіть програму, в якій користувач вводить із клавіатури діапазон чисел (в діапазоні має бути не менше 5 чисел).
 Вивести на екран суму другого, передостаннього, а також середнього арифметичного значення даної послідовності. 
"""
print(zavd_2)
print()
a, b, c, d, e = "a", "b", "c", "d", "e"
while not a.isdigit() or int(a) == 0:
        a = input("Введіть ціле число A більше нуля: ")
while not b.isdigit() or int(b) == 0:
        b = input("Введіть ціле число B більше нуля: ")
while not c.isdigit() or int(c) == 0:
        c = input("Введіть ціле число C більше нуля: ")
while not d.isdigit() or int(d) == 0:
        d = input("Введіть ціле число D більше нуля: ")
while not e.isdigit() or int(e) == 0:
        e = input("Введіть ціле число E більше нуля: ")
poslidovnist = a, b, c, d, e
print("Послідовність =", poslidovnist)
print("Сума другого да передостанього елемента=", int(poslidovnist[1]) + int(poslidovnist[-2]))
sum_posl = 0
for i in poslidovnist:
        sum_posl += int(i)
print(f"Середне арифметичне значення послідлвності {poslidovnist} =", sum_posl / len(poslidovnist))
# -----------------------------------------------
zavd_3 = """
Завдання 3
Напишіть програму, яка на вхід отримує параметри кольору (в діапазоні від 0 до 255 для кожного кольору) 
у форматі RGB і виводить на екран кортеж, у якому зберігається колір.
"""
print(zavd_3)
r, g, b = "300", "300", "300"
while not r.isdigit() or not 0 <= int(r) <= 255:
        r = input("Введіть значення R: ")
while not g.isdigit() or not 0 <= int(g) <= 255:
        g = input("Введіть значення G: ")
while not b.isdigit() or not 0 <= int(b) <= 255:
        b = input("Введіть значення B: ")
color = (r, g, b)
print("RGB color is: ", color)
# ----------------------------------------------
zavd_4 = """
Завдання 4

Ознайомтеся за допомогою документації з класами namedtuple та deque модуля collections. Створіть фабрику 
іменованих кортежів оцінок для учнів однієї групи з предметів: алгебра, геометрія, історія, інформатика, географія.
 Вивести дані на екран."""
print(zavd_4)
from collections import namedtuple
tabel = namedtuple('Табель', 'Алгебра Геометрія Історія Інформатика Географія')
ivanov = tabel('11', '12', '10', '8', '9')
petrenko = tabel('10', '8', '9', '11', '7')
sidorenko = tabel('9', '8', '12', '10', '10')
print("Сідоренко", sidorenko)
print("Іванов", ivanov)
print("Петренко", petrenko)
# ----------------------------------------
zavd_5 = """
Завдання 5

Напишіть програму, яка вводить з клавіатури послідовність чисел, перетворює послідовність на кортеж і 
виводить його відсортованим у порядку зростання. 
"""
print(zavd_5)
enter_str = input("Введіть цілі числа через пробіл: ")
str_sp = list(enter_str.split(" "))
posl = []
for i in str_sp:
    if i.isdigit():
        posl.append(int(i))
    else:
        print("Не коректно введені дані")
        break
    print(tuple(sorted(posl)))

# ------------------------------
zavd_6 = """
Завдання 6

Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», яка повинна знаходити згадки про меню, 
спортзал, обслуговування(за кожне знайдене співпадіння нараховується 5% знижки на наступне відвідування). 
Якщо фідбек перевищив 60 символів, відвідувачу надається додаткова знижка 15% на наступне відвідування.
"""
print(zavd_6)
menu = "меню"
sport = "спортзал"
obsl = "обслуговування"
vidguk = input('Введіть відгук про курорт "Морська Зірка": ')
vidguk_lover = vidguk.lower()
discont = 0
if len(vidguk_lover) > 60:
    discont += 15

vidguk_lover_1 = vidguk_lover.split(" ")
for i in vidguk_lover_1:
    if i == menu:
        discont +=5
    elif i == sport:
        discont += 5
    elif i == obsl:
        discont += 5
if discont > 0:
    print(f"Дякуємо за відгук! Ви отримали знижку {discont}% на наступну путівку!!")
else:
    print("Дякуємо за відгук!")

