zavd_6 = """
Завдання 6

Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», яка повинна знаходити згадки про меню, 
спортзал, обслуговування(за кожне знайдене співпадіння нараховується 5% знижки на наступне відвідування). 
Якщо фідбек перевищив 60 символів, відвідувачу надається додаткова знижка 15% на наступне відвідування.
"""
print(zavd_6)
menu = "меню"
sport = "спортзал"
obsl = "обслуговування"
vidguk = input('Введіть відгук про курорт "Морська Зірка": ')
vidguk_lover = vidguk.lower()
discont = 0
if len(vidguk_lover) > 60:
    discont += 15

vidguk_lover_1 = vidguk_lover.split(" ")
for i in vidguk_lover_1:
    if i == menu:
        discont +=5
    elif i == sport:
        discont += 5
    elif i == obsl:
        discont += 5

print(f"Дякуємо за відгук! Ви отримали знижку {discont}% на наступну путівку!!")





























